app/Controllers/AuthController.php

    public function login()
    {


        helper('url');
        if (strtolower($this->request->getMethod()) === 'post') {
             $email    = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            $user = $this->userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'idosiregar11@gmail.com'
 LIMIT 1

        }

        // Insert dan cek hasilnya`
        $userId = $model->insert($userData);
---
INSERT INTO `users` (`name`, `date_of_birth`, `password`, `role`, `is_verified`, `phone`, `created_at`, `updated_at`) VALUES ('Ido Refael SIregar', '1993-01-01', '$2y$10$IuKc5qIEqkcACYAJca9HxutnXI4DOYpwj3d8.4I6b/be88nFc5zEi', 'user', 0, '081362554262', '2025-08-23 08:51:43', '2025-08-23 08:51:43')

        ]);

        // Simpan ke tabel otp_codes
        $otpModel->insert([
        'user_id'    => $userId,
        'otp_code'   => $otpCode,
        'channel'    => $channel,
        'purpose'    => 'register',
        'is_used'    => 0,
        'expires_at' => date('Y-m-d H:i:s', strtotime('+5 minutes')),
        'created_at' => date('Y-m-d H:i:s')
]);
---
INSERT INTO `otp_codes` (`user_id`, `otp_code`, `channel`, `purpose`, `is_used`, `expires_at`, `created_at`, `updated_at`) VALUES (100, 17108, 'phone', 'register', 0, '2025-08-23 08:56:43', '2025-08-23 08:51:43', '2025-08-23 08:51:43')