app/Controllers/ContentController.php

public function index()
{
    // Ambil semua konten
    $contents = $this->contentModel->getAllContent();

    // Ambil hanya konten dengan type 'Video' dan status 'Published'
    $videos = $this->contentModel
                   ->where('type', 'Video')
                   ->where('status', 'Published')
                   ->findAll();
---
SELECT *
FROM `contents`
WHERE `type` = 'Video'
AND `status` = 'Published'