app/Controllers/ContentController.php

SELECT *
FROM `contents`
---
public function index()
{
    $jenis  = $this->request->getGet('jenis') ?? 'all';
    $status = $this->request->getGet('status') ?? 'all';
    $search = $this->request->getGet('search') ?? '';

    // Mulai query
    $query = $this->contentModel;

    // Filter jenis
    if ($jenis !== 'all') {
        $query = $query->where('type', ucfirst($jenis));
    }

    // Filter status
    if ($status !== 'all') {
        $query = $query->where('status', ucfirst($status));
    }

    // Filter pencarian
    if (!empty($search)) {
        $query = $query->like('title', $search)
                       ->orLike('description', $search);
    }

    $contents = $query->findAll();

SELECT *
FROM `contents`
WHERE `contents`.`id` = '8'
SELECT *
FROM `contents`
WHERE `id` != '8'
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function view($id) {
        $content = $this->contentModel->find($id);
        $comments = $this->commentModel->where('content_id', $id)->findAll();
        $related = $this->contentModel->where('id !=', $id)->orderBy('created_at', 'DESC')->limit(5)->findAll();