app/Controllers/UserController.php

SELECT *
FROM `contents`
WHERE `type` = 'Video'
AND `status` = 'Published'
---
    public function dashboard()
    {
        $videos = $this->contentModel
            ->where('type', 'Video')
            ->where('status', 'Published')
            ->findAll();