app/Models/ContentModel.php

SELECT *
FROM `contents`
---
    public function getAllContent()
    {
        return $this->findAll();

SELECT *
FROM `contents`
WHERE `contents`.`id` = '11'
---
    public function getContentById($id)
    {
        return $this->find($id);

SELECT COUNT(*) AS `numrows`
FROM `contents`
WHERE `status` = 'Published'
SELECT COUNT(*) AS `numrows`
FROM `contents`
WHERE `status` = 'Draft'
SELECT COUNT(*) AS `numrows`
FROM `contents`
WHERE `status` = 'Archived'
---
    public function getContentStats()
    {
        return [
            'total'     => $this->countAll(),
            'published' => $this->where('status', 'Publish')->countAllResults(),
            'draft'     => $this->where('status', 'Draft')->countAllResults(),
            'archived'  => $this->where('status', 'Archived')->countAllResults(),