app/Models/UserModel.php

SELECT *
FROM `users`
---
    public function getAllUsers()
    {
        return $this->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '13'
---
    public function getUserById($id)
    {
        return $this->find($id);